/*
 * الاسم: حسونه حسن بله
 * الفصل: الفرقة الثانية
 * التخصص: هندسة حاسوب
*/
#include <iostream>
/*تضمين مكتبة الادخال و الاخراج للقيام بالعمليات المتعلقة بها*/
#include <cmath>
/*تضمين مكتبة الرياضيات التي تحتوي على دوال حسابية كالجذر التربيعي
 * و القوة و ما شابه*/
#include <cstring>
/*تضمين مكتبة الحروف للقيام بعمليات تتعلق بالمقارنة بين الحروف*/
/*يتم استدعاء المكتبات لاستخدام محتوياتها في البرمجة*/
using namespace std;
/*استخدام فضاء الاسماء للمسمى std و هي تخبر المترجم ان الدوال و
 * المتغيرات مصرحة في مكان محدد من اغلب الدوال التي نستخدمها*/
char shap[20];
/*تعريف المتغير على انه يتكون من 20 حرف كحد اقصى*/
float area, space, one, side, two, three, height, width, leng, base, radios;
/*تعريف المتغيرات المذكورة على انها اعداد عشرية*/
double const pi = 3.14;
/*نقوم بتعريف المتغيرات التي سنستخدمها في الاكواد و نقوم بتعريف باي*/
int main()
/*هي الدالة الرئيسية في البرنامج و هي التي يبدأ منها تنفيذ
 * البرنامح و تكون موجودة في اي برنامج مهما كان
 * int تعني ان الدالة سترجع لنا قيمة عددية صحيحة */
{
	cout<<"\nقم بكتابة اسم الشكل الذي تريد حسابه: ";
	/*هنا يمكنك ان تكتب اسم الشكل من الاشكال المطلوبة و هي triangle,rectangle,circle,square,polygon,ellipse*/
	cin>>shap;
	/*هنا يبدا ادخال المستخدم للشكل الذي يريده قبل ان يبدا الشرط*/
	if (strcmp(shap, "triangle") == 0){
		/*الجملة الشرطية if من ضمن الجمل الشرطية الاكثر استخداما في لغة البرمجة 
		 * و ابسطها كذلك و يمكن استكمال نسار تشغيل البرنامج بعدها بجملة else 
		 * اذا لم يتحقق الشرط الاول*/
		cout<<"طول قاعدة المثلث: ";
		cin>>base;
		cout<<"ارتفاع المثلث: ";
		cin>>height;
		cout<<"طول ضلع المثلث: ";
		cin>>one;
		cout<<"الضلع الثاني: ";
		cin>>two;
		cout<<"الضلع الثالث: ";
		cin>>three;
		area=0.5*base*height;
		space=one+two+three;/*يقوم البرنامج بحساب محيط و مساحه المثلث باستخدام القاعدة*/
	}
	/*يقوم else if بالذهاب الى الشرط التالي في حالة عدم تحقق الشرط الاول*/
	else if (strcmp(shap, "rectangle") == 0){
		cout<<"ادخل عرض المستطيل: ";
		cin>>width;
		cout<<"ادخل طول المستطيل: ";
		cin>>height;
		area=width*height;
		space=2*(height + width);
		/*هذه معادلات تم اخذها من كتب الرياضيات و تستخدم لايجاد مساحة
		 * و محيط الاشكال الهندسية المطلوبة*/
	}
	else if (strcmp(shap, "square") == 0){
		cout<<"ادخل طول الضلع: ";
		cin>>leng;
		area=leng*leng;
		space=4*leng;
	}
	else if (strcmp(shap, "circle") == 0){
		cout<<"ادخل نصف قطر الدائرة: ";
		cin>>radios;
		area=pi*pow(radios, 2);
		space=2*pi*radios;
	}
	else if (strcmp(shap, "polygon") == 0){
		cout<<"ادخل طول نصف قطر المضلع: ";
		cin>>side;
		cout<<"ادخل طول ضلع المضلع: ";
		cin>>leng;
		area=0.5*side*5*leng;
		space=leng*5;
	}
	else if (strcmp(shap, "ellipse") == 0){
		double big,small;
		cout<<"ادخل طول المحور الكبير: ";
		cin>>big;
		cout<<"ادخل طول المحور الصغير: ";
		cin>>small;
		area=pi*big*small;
		space=2*pi*sqrt((pow(big, 2)+pow(small, 2)) * 0.5);
	}
	else {
		/*يقوم else بانهاء سلسلة if  حيث انه يستخدم عند عدم استيفاء
		 * شروط الدالة if ليحدث شيء اخر*/
		cout<<"لقد ادخلت اسم شكل خطأ";
	}
	/*بهذا السطر يتم عرض الجواب*/
	cout<<"\n"<<"المساحة: "<<area<<endl;
	cout<<"المحيط: "<<space<<endl;
	return 0;
	/*يتم انهاء الرنامج الان*/
}
